In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  3  9  8  5
1  4  9  3  7  3
2  5  8  7  1  3
3  9  4  6  5  1
4  6  1  1  6  5

In [6]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [8]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        4        3        9        8        5
1        4        9        3        7        3
2        5        8        7        1        3
3        9        4        6        5        1
4        6        1        1        6        5

In [10]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        4        3        9        8        5
1        4        9        3        7        3
2        5        8        7        1        3
3        9        4        6        5        1
4        6        1        1        6        5